# ServerPath Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ServerPath Constructor
ServerPath Class See Also
---
Constructs a ServerPath
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ServerPath(
	string centralServerLocation,
	string path
)
```

Visual Basic
---
```text
Public Sub New ( _
	centralServerLocation As String, _
	path As String _
)
```

Visual C++
---
```text
public:
ServerPath(
	String^ centralServerLocation,
	String^ path
)
```

# ### Parameters
centralServerLocation
    Type: System..::..String The name of the central Revit server
path
    Type: System..::..String The path of the model. This path must be relative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ServerPath Class
Autodesk.Revit.DB Namespace